def area(a, b):
    '''
        Назначение: Возвращает площадь прямоугольника

        Входные данные:

            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника

        Возвращаемое значение:

            pr_area (float): площадь прямоугольника со сторонами a и b

        Пример вызова:
            result = area(1,2)
            print(result)
            2
    '''
    return a * b 

def perimeter(a, b):
    '''
        Назначение: Возвращает периметр прямоугольника

        Входные данные:

            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника

        Возвращаемое значение:

            pr_perimetr (float): периметр прямоугольника со сторонами a и b

        Пример вызова:
            result = perimetr(1,2)
            print(result)
            6
    '''
    return (a + b)*2
