def area(a):
    '''
        Назначение: Возвращает площадь квадрата

        Входные данные:

            a (float): сторона квадрата

        Возвращаемое значение:

            kv_area (float): площадь квадрата со стороной a

        Пример вызова:
            result = area(2)
            print(result)
            4
    '''
    return a * a


def perimeter(a):
    '''
        Назначение: Возвращает периметр квадрата

        Входные данные:

            a (float): сторона квадрата

        Возвращаемое значение:

            kv_perimeter (float): периметр квадрата со стороной a

        Пример вызова:
            result = perimeter(2)
            print(result)
            8
    '''
    return 4 * a
