def area(a, h):
    '''
        Назначение: Возвращает площадь треугольника

        Входные данные:

            a (float): основание треугольника
            h (float): высота треугольника, опущенная к основанию а

        Возвращаемое значение:

            tr_area (float): площадь треугольника с основанием a и высотой h

        Пример вызова:
            result = area(1,2)
            print(result)
            1
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
        Назначение: Возвращает периметр треугольника

        Входные данные:

            a (float): первая сторона треугольника
            b (float): вторая сторона треугольника
            c (float): третья сторона треугольника
            

        Возвращаемое значение:

            tr_perimetr (float): периметр треугольника со сторонами a , b , c

        Пример вызова:
            result = perimetr(1,2,3)
            print(result)
            6
    '''
    return a + b + c 
